src/cf/InformationRegisters/СоответствиеНоменклатурыСНоменклатуройПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыСНоменклатуройПоставщика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодНоменклатурыПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеНоменклатурыПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНоменклатурыВБП</Name>
					<Comment>Для обмена с БП GT</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СоответствиеНоменклатурыСНоменклатуройПоставщика/Ext/ManagerModule.bsl
// Функция получения номенклатуры по наименованию номенклатуры поставщика
//
// Параметры:
//           - "Контрагент" - Ссылка на контрагента (Поставщик) (Обязательный) 
//           - "НаименованиеНоменклатурыПоставщика" (Обязательный) - Наименование номенклатуры поставщика
//
// Возвращаемое значение:
//           - СсылкаНаНоменклатуру
//
Функция ПолучитьНоменклатуруПоДаннымНоменклатурыПоставщика(Контрагент, НаименованиеНоменклатурыПоставщика) Экспорт
	
	запросНоменклатуры = Новый Запрос("ВЫБРАТЬ
	                                  |	СоответствиеНоменклатурыСНоменклатуройПоставщика.Номенклатура
	                                  |ИЗ
	                                  |	РегистрСведений.СоответствиеНоменклатурыСНоменклатуройПоставщика КАК СоответствиеНоменклатурыСНоменклатуройПоставщика
	                                  |ГДЕ
	                                  |	СоответствиеНоменклатурыСНоменклатуройПоставщика.Контрагент = &Контрагент
	                                  |	И СоответствиеНоменклатурыСНоменклатуройПоставщика.НаименованиеНоменклатурыПоставщика = &НаименованиеНоменклатурыПоставщика");
	запросНоменклатуры.УстановитьПараметр("Контрагент", Контрагент);	
	запросНоменклатуры.УстановитьПараметр("НаименованиеНоменклатурыПоставщика", НаименованиеНоменклатурыПоставщика);
	данныеРС = запросНоменклатуры.Выполнить().Выгрузить();
	Если данныеРС.Количество() > 0 Тогда
		ссылкаНаНоменклатуру = данныеРС[0].Номенклатура;
	Иначе
		ссылкаНаНоменклатуру = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	
	Возврат ссылкаНаНоменклатуру;
	
КонецФункции	


// Процедура обновления данных о номенкалатуре поставщика 
//
// Параметры:
//           - "СсылкаНаДокумент" - Ссылка на документ (Обязательный)
//
Процедура ОбновлениеДанныхОНоменклатуреПоставщика(СсылкаНаДокумент) Экспорт
	
	Для Каждого стрДокумента Из СсылкаНаДокумент.Товары Цикл
		Если ЗначениеЗаполнено(стрДокумента.Номенклатура) И ЗначениеЗаполнено(стрДокумента.НаименованиеНоменклатурыПоставщика) Тогда
			менеджерЗаписиРС = РегистрыСведений.СоответствиеНоменклатурыСНоменклатуройПоставщика.СоздатьМенеджерЗаписи();
			менеджерЗаписиРС.Номенклатура = стрДокумента.Номенклатура;
			менеджерЗаписиРС.Контрагент = СсылкаНаДокумент.Контрагент;
			менеджерЗаписиРС.Прочитать();
			
			Если менеджерЗаписиРС.Выбран() Тогда
				
				// в условиях участвует более 1 раза
				пустоеНовоеНаименованиеНоменклатурыПоставщика = СокрЛП(стрДокумента.НаименованиеНоменклатурыПоставщика) = "";
				
				// Найдена запись
				Если стрДокумента.КодНоменклатурыПоставщика <> менеджерЗаписиРС.КодНоменклатурыПоставщика 
					ИЛИ (стрДокумента.НаименованиеНоменклатурыПоставщика <> менеджерЗаписиРС.НаименованиеНоменклатурыПоставщика И НЕ пустоеНовоеНаименованиеНоменклатурыПоставщика)  Тогда
					
					Если НЕ пустоеНовоеНаименованиеНоменклатурыПоставщика Тогда
						менеджерЗаписиРС.НаименованиеНоменклатурыПоставщика = СокрЛП(стрДокумента.НаименованиеНоменклатурыПоставщика);
					КонецЕСли;	
					
					менеджерЗаписиРС.КодНоменклатурыПоставщика = стрДокумента.КодНоменклатурыПоставщика;
					менеджерЗаписиРС.Записать();
				КонецЕсли;	
			Иначе	
				// Создаем запись в регистре
				менеджерЗаписиРС.Номенклатура = стрДокумента.Номенклатура;
				менеджерЗаписиРС.Контрагент = СсылкаНаДокумент.Контрагент;
				менеджерЗаписиРС.КодНоменклатурыПоставщика = стрДокумента.КодНоменклатурыПоставщика;
				менеджерЗаписиРС.НаименованиеНоменклатурыПоставщика = стрДокумента.НаименованиеНоменклатурыПоставщика;
				менеджерЗаписиРС.Записать();
			КонецЕсли;	
			
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
